Revit 2026 API

# SpaceFloorReflectance Property

---

Get or set the Floor Reflectance of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FloorReflectance { get; set; }
```
```vb
Public Property FloorReflectance As Double
	Get
	Set
```
```cpp
public:
property double FloorReflectance {
	double get ();
	void set (double value);
}
```
```fsharp
member FloorReflectance : float with get, set
```

#### Property Value

Double

This property is used to get or set the Floor Reflectance of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace